{
  "tone": "visceral, low-magic, high-adventure; inspired by Robert E. Howard, Karl Edward Wagner, and Michael Moorcock.",
  "professions": {
    "Alchemist": "A tinkerer in smoke and secrets, forever chasing gold or godhood. Their hands reek of mercury and madness.",
    "Apothecary": "A healer who knows that every cure is a slow poison in disguise. They sell salvation by the ounce.",
    "Armorer": "A smith hardened by fire and war. Their craft protects kings and killers alike, but never themselves.",
    "Assassin": "A patient hunter of men. Death is their creed, and silence their sermon.",
    "Baker": "A simple soul in a savage world, kneading bread as others knead bone. They know hunger better than mercy.",
    "Bard": "A jester and liar who sings of glory to those dying for it. Their words are sharper than daggers.",
    "Blacksmith": "A hammer-wielding god among men. They forge beauty for slaughter, strength for tyranny.",
    "Bounty Hunter": "A dog chasing the scent of coin. Their quarry bleeds, their conscience does not.",
    "Brewer": "A conjurer of forgetfulness. Their craft dulls pain, breeds courage, and kills slow.",
    "Captain of the Guard": "A weary veteran standing watch over a dying order. Their loyalty is the last wall between peace and ruin.",
    "Cartographer": "A mad dreamer mapping places men should never walk. Their maps are written in ink and blood.",
    "Cleric": "A pilgrim with faith enough to wound. They offer salvation with the same hands that bless the blade.",
    "Druid": "A creature half-man, half-memory of the wild. Their allegiance is to the soil, not the souls that tread it.",
    "Enchanter": "A trickster who binds will to whispers. Their power is illusion given teeth.",
    "Falconer": "A loner whose only friend circles above. They see what others miss — and strike when others flinch.",
    "Fighter": "A blade without a cause. The world gives them nothing but battle, and they take it gladly.",
    "Grave Digger": "A quiet keeper of the dead. Their shovel knows more secrets than most priests.",
    "Healer": "A saint of scars. Their mercy is cruel — saving bodies the gods have already abandoned.",
    "Herald": "A silver-tongued herald of doom, bearing news no man wants and truths no one can face.",
    "Hunter": "A predator of beasts and men alike. The chase is their prayer, and death their offering.",
    "Innkeeper": "A watcher of weary travelers. They’ve heard every story, buried a few tellers.",
    "Inquisitor": "A zealot in black robes. Their justice burns brighter than their faith.",
    "Jailer": "A warden of regret and iron. They hold the damned and dream of freedom.",
    "Jester": "A fool who laughs in the face of kings. Madness and wisdom share their mask.",
    "Knight": "A rusted blade in a polished shell. They follow codes written by ghosts.",
    "Mercenary": "A sword for sale, loyal only to the weight of gold and the promise of survival.",
    "Merchant": "A trader of goods and souls alike. Profit is their god, and they pray in ledgers.",
    "Miner": "A mole among men. They dig deep into the earth, unearthing wealth — or their own graves.",
    "Monk": "A wanderer of silence and discipline. Their fists preach what their words will not.",
    "Necromancer": "A scholar of rot. They make bargains with the grave and call it knowledge.",
    "Oracle": "A vessel of prophecy and madness. They speak truths that flay sanity raw.",
    "Page": "A servant chasing honor’s shadow. Their courage grows faster than their wisdom.",
    "Paladin": "A zealot in shining ruin. They carry faith like a torch through the dark — burning themselves first.",
    "Plague Doctor": "A physician of death who wears the mask of mercy. They walk where even crows fear to roost.",
    "Priest": "A voice of dying gods, offering absolution to the damned. Their prayers taste of rust.",
    "Ranger": "A shadow between the trees, loyal to no crown but the wild’s.",
    "Rat Catcher": "A survivor who thrives in filth. They see corruption before the noblemen smell it.",
    "Rogue": "A smile that hides the knife. They cheat death with charm, and luck with sin.",
    "Runesmith": "A carver of symbols and secrets. Each stroke binds their blood to the old powers.",
    "Sage": "A scholar of forgotten things, weighed down by the knowledge that some truths should stay buried.",
    "Scribe": "A recorder of lies told as history. Their quill has ended more lives than swords.",
    "Sellsword": "A blade bound by coin, never creed. They kill without cause — or question.",
    "Shaman": "A bridge to the unseen, half-mad and wholly feared. Spirits whisper through their broken tongue.",
    "Shipwright": "A craftsman who builds freedom for others and dies on land. Salt and sawdust are their legacy.",
    "Smuggler": "A merchant of forbidden wares. Every port knows their lies, every tide hides their guilt.",
    "Sorcerer": "A vessel of untamed power. Their blood hums with something not quite mortal.",
    "Squire": "An eager youth chasing glory, blind to the corpses it’s built on.",
    "Swashbuckler": "A reckless charmer who laughs in the face of death — until it laughs back.",
    "Tanner": "A worker of hides and stench. They know that everything worth keeping must first be flayed.",
    "Wizard": "An old wanderer who speaks the language of storms and secrets. Their wisdom smells faintly of decay.",
    "Archer": "A silent death from afar. Their bow sings only dirges.",
    "Gladiator": "A chained beast painted in blood and applause. They fight because the world demands spectacle.",
    "Scholar": "A thinker among brutes, dissecting the madness of men with fragile words.",
    "Artist": "A creator of beauty in a land that worships ruin. Their art is rebellion carved in color and pain.",
    "Guard": "A weary sentinel who’s seen every gate fall. They keep the peace only until the next riot.",
    "Brute": "A creature of muscle and rage. They fight not for coin or cause — only because it’s what they were made to do."
  },
  "tarot": {
    "major_arcana": {
      "The Fool": "A wanderer with no map and no master, chasing the horizon with empty hands. Every path he takes is a gamble with fate.",
      "The Magician": "A man who bends circumstance to his will — not through spells, but sheer audacity. He makes the impossible bow to determination.",
      "The High Priestess": "A keeper of secrets and old oaths. Her knowledge is earned in silence, and her truths cost dearly.",
      "The Empress": "A queen of life and loss. She builds what she loves, and watches it crumble just to prove she can build again.",
      "The Emperor": "A ruler who conquered not by wisdom, but by endurance. His reign is the peace between two wars.",
      "The Hierophant": "A voice of order in a lawless world. His faith is iron, but every creed hides its rot.",
      "The Lovers": "Two souls bound not by fate, but by choice — and the ruin that follows it.",
      "The Chariot": "A conqueror who rides through chaos with grit and will. Victory is his only compass.",
      "Strength": "A hand that doesn’t falter and a heart that doesn’t yield. The wild obeys her because she never learned to fear it.",
      "The Hermit": "A loner who’s seen too much of men. He seeks meaning where there is none — and keeps walking anyway.",
      "Wheel of Fortune": "The turning of chance — one day a king, the next a corpse. No man can stop the wheel, only cling to it.",
      "Justice": "A hard truth wrapped in steel. She balances the scales with blood, because nothing else ever holds.",
      "The Hanged Man": "A man caught between choice and consequence. Hanging there, he sees the cost of every step he took.",
      "Death": "An ending that makes room for something harsher. Not a phantom, but a change that cuts deep and clean.",
      "Temperance": "The fighter who knows when to strike and when to hold back. Balance is survival, not peace.",
      "The Devil": "The hunger that drives men to damn themselves. He wears the face of temptation and the grin of opportunity.",
      "The Tower": "Every fortress, no matter how strong, must fall. Pride builds tall walls; time and flame tear them down.",
      "The Star": "A flicker of hope seen through smoke and ruin. It’s fragile — but men have marched through hell for less.",
      "The Moon": "Deception and uncertainty. The night hides teeth, and even the brave can lose their way.",
      "The Sun": "Hard-earned triumph that burns as bright as it blinds. Joy is fleeting, but worth every scar.",
      "Judgment": "The day your past catches up and demands its due. There is no appeal, only reckoning.",
      "The World": "Completion through struggle. The journey ends, not in glory, but in the quiet knowing that you endured."
    },
    "minor_arcana": {
      "Wands": {
        "Ace of Wands": "The first spark of ambition — a reckless idea born of hunger. It burns hot and fast, daring the fool to chase it.",
        "Two of Wands": "A choice made with eyes on the horizon. The dreamer grips his weapon and measures the world, wondering which way to carve his name into it.",
        "Three of Wands": "The journey begun, the past left to rot. The road is long, but only the bold ever see what lies beyond the hills.",
        "Four of Wands": "A fleeting moment of triumph — a firelit night, a cup raised high. Tomorrow the road calls again.",
        "Five of Wands": "Five men, one prize. Steel, sweat, and pride crash together, and no one walks away unmarked.",
        "Six of Wands": "Victory tastes of smoke and blood. The crowd cheers, but envy waits behind every smile.",
        "Seven of Wands": "One man stands against many, battered but unbroken. The desperate fight hardest when they have nowhere left to run.",
        "Eight of Wands": "The world moves fast, and hesitation kills. Arrows fly, words cut — the moment’s gone if you don’t seize it.",
        "Nine of Wands": "A fighter still standing after a dozen falls. Every scar is proof that pain can’t claim him yet.",
        "Ten of Wands": "The burden grows heavy — victory’s spoils turned to chains. He carries his own ambition like a cross.",
        "Page of Wands": "A hot-blooded youth chasing danger for glory. Courage without wisdom is just another way to die young.",
        "Knight of Wands": "A restless wanderer, charging toward the next battle, the next bed, the next mistake. He burns fast and bright.",
        "Queen of Wands": "A woman of fire and command — she leads through passion, and her followers would walk through flame for her.",
        "King of Wands": "A ruler forged in conflict, his crown earned by endurance. His fire still burns, but each victory costs him another piece of his soul."
      },
      "Cups": {
        "Ace of Cups": "A fragile spark of hope in a calloused heart. Once poured, it can never be reclaimed.",
        "Two of Cups": "Two lives intertwined for a time — in love, in loyalty, or in shared ruin. Bonds like this never end clean.",
        "Three of Cups": "A brief joy among comrades. Tankards raised, laughter echoing — but dawn always brings the hangover of truth.",
        "Four of Cups": "A soldier grown numb to victory and wine alike. The cup overflows, but he can’t taste a drop.",
        "Five of Cups": "Loss carved into flesh and memory. The past haunts, and what remains is bitter comfort.",
        "Six of Cups": "A memory sweet enough to hurt. Childhood gone, innocence trampled under muddy boots.",
        "Seven of Cups": "Dreams as traps — riches, power, love — all shimmering illusions. The wise man sees the poison in the cup.",
        "Eight of Cups": "The wanderer walking away from everything, chasing a meaning that will likely kill him.",
        "Nine of Cups": "A man surrounded by what he wanted, and hollow because of it. Satisfaction is a lie whispered by comfort.",
        "Ten of Cups": "Peace that can’t last. The family fire burns bright before the storm tears the roof away.",
        "Page of Cups": "A fool with a soft heart in a hard land. Kindness is his blade, and it’s far too dull.",
        "Knight of Cups": "A lover, a dreamer, a doomed romantic. His cause is noble, his end inevitable.",
        "Queen of Cups": "A woman who feels too deeply — healer, seer, or liar. Her mercy is a knife wrapped in silk.",
        "King of Cups": "A ruler who drinks to quiet the ghosts. Wisdom and sorrow share his throne, and neither ever leaves."
      },
      "Swords": {
        "Ace of Swords": "A single stroke that changes everything. Truth, justice, or vengeance — all are sharp enough to draw blood.",
        "Two of Swords": "Two choices, both bad. The blade hesitates, and in that pause, the enemy moves.",
        "Three of Swords": "A wound of the heart that cuts deeper than steel. Betrayal is just another form of honesty.",
        "Four of Swords": "Rest in the shadow of battle. A man sleeps clutching his sword, dreaming of the next fight.",
        "Five of Swords": "Victory with no honor. The clever man survives, but his reflection no longer meets his gaze.",
        "Six of Swords": "A silent crossing — leaving behind what can’t be saved. Each oar stroke is a farewell.",
        "Seven of Swords": "A thief in the dark, carrying too much. Strategy is survival, and cowardice another name for living.",
        "Eight of Swords": "Trapped by fear and consequence. The bars are in the mind, but they cut all the same.",
        "Nine of Swords": "Night terrors born of guilt and memory. He’s fought every enemy but himself, and now he’s losing.",
        "Ten of Swords": "The end, ignoble and inevitable. The fallen lie where they fell, and the crows sing their elegy.",
        "Page of Swords": "A quick mind with a sharper tongue. He wants to prove himself, and the world will gladly test him.",
        "Knight of Swords": "A reckless warrior who lives for the charge. He cuts through foes and friends alike — always forward, never back.",
        "Queen of Swords": "Cold and sharp as winter steel. She has no illusions left, and her truth hurts because it’s real.",
        "King of Swords": "A commander who’s forgotten mercy. He wins battles, loses souls, and keeps marching."
      },
      "Pentacles": {
        "Ace of Pentacles": "The first glint of coin or promise — an opportunity that smells of sweat and danger.",
        "Two of Pentacles": "A juggler caught between debts and duty. Balance is survival, but the rope frays fast.",
        "Three of Pentacles": "Craft born of calloused hands and sleepless nights. Greatness is carved from exhaustion, not inspiration.",
        "Four of Pentacles": "A miser clutching his hoard, fearing loss more than death. What he owns now owns him.",
        "Five of Pentacles": "Cold wind, empty belly, no shelter. The world doesn’t forgive weakness — it starves it.",
        "Six of Pentacles": "Charity offered with one hand, and a knife hidden in the other. Kindness is always bought with power.",
        "Seven of Pentacles": "A farmer watching barren fields, waiting for reward that never comes. Patience or futility — only time knows.",
        "Eight of Pentacles": "The craftsman’s grind, endless and precise. Skill is its own prison when perfection is never enough.",
        "Nine of Pentacles": "Hard-won success — a rare peace, but it cost more than it was worth. Freedom always tastes faintly of ashes.",
        "Ten of Pentacles": "Legacy built on bones. The old man’s wealth feeds heirs who will forget his name by morning.",
        "Page of Pentacles": "A dreamer chasing coin instead of glory. Ambition is noble until it turns to greed.",
        "Knight of Pentacles": "A soldier of routine, stubborn and steady. The world breaks around him, but he keeps to his road.",
        "Queen of Pentacles": "A matron of scarcity and survival. She rules with a ledger instead of a crown, and nothing escapes her count.",
        "King of Pentacles": "A monarch of mud and gold. He built his throne from toil and blood, and dares any man to take it from him."
      }
    }
  }
}
